---
kind: other
id: Properties.T:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint
source: html/b43d263b-a0d8-0453-648b-fb984ff80512.htm
---
# HorizontalCurveEndpoint Properties

The HorizontalCurveType
 of the curve which connects the endpoint to the next displayed curve.
 If this endpoint's Station equals
 DisplayedEndStation , returns Unknown curve type.